AlexBakshaev/bq25601-stm32-library/Demo_BQ25601_L072/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2025 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32l0xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define WKUP_QON_Pin GPIO_PIN_0
#define WKUP_QON_GPIO_Port GPIOA
#define CHG_PG_Pin GPIO_PIN_10
#define CHG_PG_GPIO_Port GPIOB
#define CHG_STAT_Pin GPIO_PIN_8
#define CHG_STAT_GPIO_Port GPIOA
#define CHG_SCL_Pin GPIO_PIN_9
#define CHG_SCL_GPIO_Port GPIOA
#define CHG_SDA_Pin GPIO_PIN_10
#define CHG_SDA_GPIO_Port GPIOA
#define DBG_TX_Pin GPIO_PIN_10
#define DBG_TX_GPIO_Port GPIOC
#define DBG_RX_Pin GPIO_PIN_11
#define DBG_RX_GPIO_Port GPIOC
#define CHG_CE_Pin GPIO_PIN_12
#define CHG_CE_GPIO_Port GPIOC
#define CHG_INT_Pin GPIO_PIN_2
#define CHG_INT_GPIO_Port GPIOD
#define CHG_INT_EXTI_IRQn EXTI2_3_IRQn
#define CHG_QON_Pin GPIO_PIN_3
#define CHG_QON_GPIO_Port GPIOB

/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
